CREATE TABLE IF NOT EXISTS `detail` (
  `Name` VARCHAR(255),
  `Date` DATE,
  `Magnitude` FLOAT,
  `Depth` FLOAT,
  `Longitude` DOUBLE,
  `Latitude` DOUBLE,
  `PlaceName` VARCHAR(255),
  `Index` VARCHAR(255)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- Insert Data
INSERT INTO `detail` VALUES 
('能登半島地震', '2023-05-05', 6.5, 12, 137.0 + (18.2 / 60), 37.0 + (32.3 / 60), '能登半島沖', '20230505'),
('胆振地方中東部地震', '2018-09-06', 6.7, 37, 142.0 + (0.4 / 60), 42.0 + (41.4 / 60), '胆振地方中東部', '20180906'),
('熊本地震主震', '2016-04-16', 7.3, 12, 130.0 + (45.7 / 60), 32.0 + (45.2 / 60), '熊本県熊本地方', '20160416'),
('熊本地震前震', '2016-04-14', 6.5, 11, 130.0 + (48.5 / 60), 32.0 + (44.5 / 60), '熊本県熊本地方', '20160414'),
('東日本大震災', '2011-03-11', 9.0, 24, 142.0 + (51.6 / 60), 38.0 + (6.2 / 60), '三陸沖', '20110311'),
('新潟県中越地方地震', '2004-10-23', 6.8, 13, 138.0 + (52.0 / 60), 37.0 + (17.5 / 60), '新潟県中越地方', '20041023');